//Написать программу, выводящую информацию о вас (имя, фамилия, профессия).
public class Task1 {
    public static void main(String[] args) {
        String name = "Юрий";
        String secondName = "Скачков";
        String profession = "manual QA engineer";
        System.out.printf(" Имя: %s;\n Фамилия: %s;\n Профессия: %s.", name, secondName, profession);

    }

}